GopalSaraf/Practicals/PSDL/include/proc/pic16lf18857.h
// Register: SMT1PRU
#define SMT1PRU SMT1PRU
extern volatile unsigned char           SMT1PRU             __at(0x497);
#ifndef _LIB_BUILD
asm("SMT1PRU equ 0497h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :8;
    };
    struct {
        unsigned PR16                   :1;
        unsigned PR17                   :1;
        unsigned PR18                   :1;
        unsigned PR19                   :1;
        unsigned PR20                   :1;
        unsigned PR21                   :1;
        unsigned PR22                   :1;
        unsigned PR23                   :1;
    };
    struct {
        unsigned SMT1PR                 :8;
    };
    struct {
        unsigned SMT1PR16               :1;
        unsigned SMT1PR17               :1;
        unsigned SMT1PR18               :1;
        unsigned SMT1PR19               :1;
        unsigned SMT1PR20               :1;
        unsigned SMT1PR21               :1;
        unsigned SMT1PR22               :1;
        unsigned SMT1PR23               :1;
    };
} SMT1PRUbits_t;
extern volatile SMT1PRUbits_t SMT1PRUbits __at(0x497);
// bitfield macros
#define _SMT1PRU_PR_POSN                                    0x0
#define _SMT1PRU_PR_POSITION                                0x0
#define _SMT1PRU_PR_SIZE                                    0x8
#define _SMT1PRU_PR_LENGTH                                  0x8
#define _SMT1PRU_PR_MASK                                    0xFF
#define _SMT1PRU_PR16_POSN                                  0x0
#define _SMT1PRU_PR16_POSITION                              0x0
#define _SMT1PRU_PR16_SIZE                                  0x1
#define _SMT1PRU_PR16_LENGTH                                0x1
#define _SMT1PRU_PR16_MASK                                  0x1
#define _SMT1PRU_PR17_POSN                                  0x1
#define _SMT1PRU_PR17_POSITION                              0x1
#define _SMT1PRU_PR17_SIZE                                  0x1
#define _SMT1PRU_PR17_LENGTH                                0x1
#define _SMT1PRU_PR17_MASK                                  0x2
#define _SMT1PRU_PR18_POSN                                  0x2
#define _SMT1PRU_PR18_POSITION                              0x2
#define _SMT1PRU_PR18_SIZE                                  0x1
#define _SMT1PRU_PR18_LENGTH                                0x1
#define _SMT1PRU_PR18_MASK                                  0x4
#define _SMT1PRU_PR19_POSN                                  0x3
#define _SMT1PRU_PR19_POSITION                              0x3
#define _SMT1PRU_PR19_SIZE                                  0x1
#define _SMT1PRU_PR19_LENGTH                                0x1
#define _SMT1PRU_PR19_MASK                                  0x8
#define _SMT1PRU_PR20_POSN                                  0x4
#define _SMT1PRU_PR20_POSITION                              0x4
#define _SMT1PRU_PR20_SIZE                                  0x1
#define _SMT1PRU_PR20_LENGTH                                0x1
#define _SMT1PRU_PR20_MASK                                  0x10
#define _SMT1PRU_PR21_POSN                                  0x5
#define _SMT1PRU_PR21_POSITION                              0x5
#define _SMT1PRU_PR21_SIZE                                  0x1
#define _SMT1PRU_PR21_LENGTH                                0x1
#define _SMT1PRU_PR21_MASK                                  0x20
#define _SMT1PRU_PR22_POSN                                  0x6
#define _SMT1PRU_PR22_POSITION                              0x6
#define _SMT1PRU_PR22_SIZE                                  0x1
#define _SMT1PRU_PR22_LENGTH                                0x1
#define _SMT1PRU_PR22_MASK                                  0x40
#define _SMT1PRU_PR23_POSN                                  0x7
#define _SMT1PRU_PR23_POSITION                              0x7
#define _SMT1PRU_PR23_SIZE                                  0x1
#define _SMT1PRU_PR23_LENGTH                                0x1
#define _SMT1PRU_PR23_MASK                                  0x80
#define _SMT1PRU_SMT1PR_POSN                                0x0
#define _SMT1PRU_SMT1PR_POSITION                            0x0
#define _SMT1PRU_SMT1PR_SIZE                                0x8
#define _SMT1PRU_SMT1PR_LENGTH                              0x8
#define _SMT1PRU_SMT1PR_MASK                                0xFF
#define _SMT1PRU_SMT1PR16_POSN                              0x0
#define _SMT1PRU_SMT1PR16_POSITION                          0x0
#define _SMT1PRU_SMT1PR16_SIZE                              0x1
#define _SMT1PRU_SMT1PR16_LENGTH                            0x1
#define _SMT1PRU_SMT1PR16_MASK                              0x1
#define _SMT1PRU_SMT1PR17_POSN                              0x1
#define _SMT1PRU_SMT1PR17_POSITION                          0x1
#define _SMT1PRU_SMT1PR17_SIZE                              0x1
#define _SMT1PRU_SMT1PR17_LENGTH                            0x1
#define _SMT1PRU_SMT1PR17_MASK                              0x2
#define _SMT1PRU_SMT1PR18_POSN                              0x2
#define _SMT1PRU_SMT1PR18_POSITION                          0x2
#define _SMT1PRU_SMT1PR18_SIZE                              0x1
#define _SMT1PRU_SMT1PR18_LENGTH                            0x1
#define _SMT1PRU_SMT1PR18_MASK                              0x4
#define _SMT1PRU_SMT1PR19_POSN                              0x3
#define _SMT1PRU_SMT1PR19_POSITION                          0x3
#define _SMT1PRU_SMT1PR19_SIZE                              0x1
#define _SMT1PRU_SMT1PR19_LENGTH                            0x1
#define _SMT1PRU_SMT1PR19_MASK                              0x8
#define _SMT1PRU_SMT1PR20_POSN                              0x4
#define _SMT1PRU_SMT1PR20_POSITION                          0x4
#define _SMT1PRU_SMT1PR20_SIZE                              0x1
#define _SMT1PRU_SMT1PR20_LENGTH                            0x1
#define _SMT1PRU_SMT1PR20_MASK                              0x10
#define _SMT1PRU_SMT1PR21_POSN                              0x5
#define _SMT1PRU_SMT1PR21_POSITION                          0x5
#define _SMT1PRU_SMT1PR21_SIZE                              0x1
#define _SMT1PRU_SMT1PR21_LENGTH                            0x1
#define _SMT1PRU_SMT1PR21_MASK                              0x20
#define _SMT1PRU_SMT1PR22_POSN                              0x6
#define _SMT1PRU_SMT1PR22_POSITION                          0x6
#define _SMT1PRU_SMT1PR22_SIZE                              0x1
#define _SMT1PRU_SMT1PR22_LENGTH                            0x1
#define _SMT1PRU_SMT1PR22_MASK                              0x40
#define _SMT1PRU_SMT1PR23_POSN                              0x7
#define _SMT1PRU_SMT1PR23_POSITION                          0x7
#define _SMT1PRU_SMT1PR23_SIZE                              0x1
#define _SMT1PRU_SMT1PR23_LENGTH                            0x1
#define _SMT1PRU_SMT1PR23_MASK                              0x80

// Register: SMT1CON0
#define SMT1CON0 SMT1CON0
extern volatile unsigned char           SMT1CON0            __at(0x498);
#ifndef _LIB_BUILD
asm("SMT1CON0 equ 0498h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PS                     :2;
        unsigned CPOL                   :1;
        unsigned SPOL                   :1;
        unsigned WPOL                   :1;
        unsigned STP                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned SMT1PS                 :2;
        unsigned SMT1CPOL               :1;
        unsigned SMT1SPOL               :1;
        unsigned SMT1WOL                :1;
        unsigned SMT1STP                :1;
        unsigned                        :1;
        unsigned SMT1EN                 :1;
    };
    struct {
        unsigned PS0                    :1;
        unsigned PS1                    :1;
    };
    struct {
        unsigned SMT1PS0                :1;
        unsigned SMT1PS1                :1;
    };
} SMT1CON0bits_t;
extern volatile SMT1CON0bits_t SMT1CON0bits __at(0x498);
// bitfield macros
#define _SMT1CON0_PS_POSN                                   0x0
#define _SMT1CON0_PS_POSITION                               0x0
#define _SMT1CON0_PS_SIZE                                   0x2
#define _SMT1CON0_PS_LENGTH                                 0x2
#define _SMT1CON0_PS_MASK                                   0x3
#define _SMT1CON0_CPOL_POSN                                 0x2
#define _SMT1CON0_CPOL_POSITION                             0x2
#define _SMT1CON0_CPOL_SIZE                                 0x1
#define _SMT1CON0_CPOL_LENGTH                               0x1
#define _SMT1CON0_CPOL_MASK                                 0x4
#define _SMT1CON0_SPOL_POSN                                 0x3
#define _SMT1CON0_SPOL_POSITION                             0x3
#define _SMT1CON0_SPOL_SIZE                                 0x1
#define _SMT1CON0_SPOL_LENGTH                               0x1
#define _SMT1CON0_SPOL_MASK                                 0x8
#define _SMT1CON0_WPOL_POSN                                 0x4
#define _SMT1CON0_WPOL_POSITION                             0x4
#define _SMT1CON0_WPOL_SIZE                                 0x1
#define _SMT1CON0_WPOL_LENGTH                               0x1
#define _SMT1CON0_WPOL_MASK                                 0x10
#define _SMT1CON0_STP_POSN                                  0x5
#define _SMT1CON0_STP_POSITION                              0x5
#define _SMT1CON0_STP_SIZE                                  0x1
#define _SMT1CON0_STP_LENGTH                                0x1
#define _SMT1CON0_STP_MASK                                  0x20
#define _SMT1CON0_EN_POSN                                   0x7
#define _SMT1CON0_EN_POSITION                               0x7
#define _SMT1CON0_EN_SIZE                                   0x1
#define _SMT1CON0_EN_LENGTH                                 0x1
#define _SMT1CON0_EN_MASK                                   0x80
#define _SMT1CON0_SMT1PS_POSN                               0x0
#define _SMT1CON0_SMT1PS_POSITION                           0x0
#define _SMT1CON0_SMT1PS_SIZE                               0x2
#define _SMT1CON0_SMT1PS_LENGTH                             0x2
#define _SMT1CON0_SMT1PS_MASK                               0x3
#define _SMT1CON0_SMT1CPOL_POSN                             0x2
#define _SMT1CON0_SMT1CPOL_POSITION                         0x2
#define _SMT1CON0_SMT1CPOL_SIZE                             0x1
#define _SMT1CON0_SMT1CPOL_LENGTH                           0x1
#define _SMT1CON0_SMT1CPOL_MASK                             0x4
#define _SMT1CON0_SMT1SPOL_POSN                             0x3
#define _SMT1CON0_SMT1SPOL_POSITION                         0x3
#define _SMT1CON0_SMT1SPOL_SIZE                             0x1
#define _SMT1CON0_SMT1SPOL_LENGTH                           0x1
#define _SMT1CON0_SMT1SPOL_MASK                             0x8
#define _SMT1CON0_SMT1WOL_POSN                              0x4
#define _SMT1CON0_SMT1WOL_POSITION                          0x4
#define _SMT1CON0_SMT1WOL_SIZE                              0x1
#define _SMT1CON0_SMT1WOL_LENGTH                            0x1
#define _SMT1CON0_SMT1WOL_MASK                              0x10
#define _SMT1CON0_SMT1STP_POSN                              0x5
#define _SMT1CON0_SMT1STP_POSITION                          0x5
#define _SMT1CON0_SMT1STP_SIZE                              0x1
#define _SMT1CON0_SMT1STP_LENGTH                            0x1
#define _SMT1CON0_SMT1STP_MASK                              0x20
#define _SMT1CON0_SMT1EN_POSN                               0x7
#define _SMT1CON0_SMT1EN_POSITION                           0x7
#define _SMT1CON0_SMT1EN_SIZE                               0x1
#define _SMT1CON0_SMT1EN_LENGTH                             0x1
#define _SMT1CON0_SMT1EN_MASK                               0x80
#define _SMT1CON0_PS0_POSN                                  0x0
#define _SMT1CON0_PS0_POSITION                              0x0
#define _SMT1CON0_PS0_SIZE                                  0x1
#define _SMT1CON0_PS0_LENGTH                                0x1
#define _SMT1CON0_PS0_MASK                                  0x1
#define _SMT1CON0_PS1_POSN                                  0x1
#define _SMT1CON0_PS1_POSITION                              0x1
#define _SMT1CON0_PS1_SIZE                                  0x1
#define _SMT1CON0_PS1_LENGTH                                0x1
#define _SMT1CON0_PS1_MASK                                  0x2
#define _SMT1CON0_SMT1PS0_POSN                              0x0
#define _SMT1CON0_SMT1PS0_POSITION                          0x0
#define _SMT1CON0_SMT1PS0_SIZE                              0x1
#define _SMT1CON0_SMT1PS0_LENGTH                            0x1
#define _SMT1CON0_SMT1PS0_MASK                              0x1
#define _SMT1CON0_SMT1PS1_POSN                              0x1
#define _SMT1CON0_SMT1PS1_POSITION                          0x1
#define _SMT1CON0_SMT1PS1_SIZE                              0x1
#define _SMT1CON0_SMT1PS1_LENGTH                            0x1
#define _SMT1CON0_SMT1PS1_MASK                              0x2

