GopalSaraf/Practicals/PSDL/include/proc/pic16lf18857.h
// Register: PIE6
#define PIE6 PIE6
extern volatile unsigned char           PIE6                __at(0x71C);
#ifndef _LIB_BUILD
asm("PIE6 equ 071Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1IE                 :1;
        unsigned CCP2IE                 :1;
        unsigned CCP3IE                 :1;
        unsigned CCP4IE                 :1;
        unsigned CCP5IE                 :1;
    };
} PIE6bits_t;
extern volatile PIE6bits_t PIE6bits __at(0x71C);
// bitfield macros
#define _PIE6_CCP1IE_POSN                                   0x0
#define _PIE6_CCP1IE_POSITION                               0x0
#define _PIE6_CCP1IE_SIZE                                   0x1
#define _PIE6_CCP1IE_LENGTH                                 0x1
#define _PIE6_CCP1IE_MASK                                   0x1
#define _PIE6_CCP2IE_POSN                                   0x1
#define _PIE6_CCP2IE_POSITION                               0x1
#define _PIE6_CCP2IE_SIZE                                   0x1
#define _PIE6_CCP2IE_LENGTH                                 0x1
#define _PIE6_CCP2IE_MASK                                   0x2
#define _PIE6_CCP3IE_POSN                                   0x2
#define _PIE6_CCP3IE_POSITION                               0x2
#define _PIE6_CCP3IE_SIZE                                   0x1
#define _PIE6_CCP3IE_LENGTH                                 0x1
#define _PIE6_CCP3IE_MASK                                   0x4
#define _PIE6_CCP4IE_POSN                                   0x3
#define _PIE6_CCP4IE_POSITION                               0x3
#define _PIE6_CCP4IE_SIZE                                   0x1
#define _PIE6_CCP4IE_LENGTH                                 0x1
#define _PIE6_CCP4IE_MASK                                   0x8
#define _PIE6_CCP5IE_POSN                                   0x4
#define _PIE6_CCP5IE_POSITION                               0x4
#define _PIE6_CCP5IE_SIZE                                   0x1
#define _PIE6_CCP5IE_LENGTH                                 0x1
#define _PIE6_CCP5IE_MASK                                   0x10

// Register: PIE7
#define PIE7 PIE7
extern volatile unsigned char           PIE7                __at(0x71D);
#ifndef _LIB_BUILD
asm("PIE7 equ 071Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CWG1IE                 :1;
        unsigned CWG2IE                 :1;
        unsigned CWG3IE                 :1;
        unsigned                        :1;
        unsigned NCO1IE                 :1;
        unsigned NVMIE                  :1;
        unsigned CRCIE                  :1;
        unsigned SCANIE                 :1;
    };
    struct {
        unsigned                        :4;
        unsigned NCOIE                  :1;
    };
} PIE7bits_t;
extern volatile PIE7bits_t PIE7bits __at(0x71D);
// bitfield macros
#define _PIE7_CWG1IE_POSN                                   0x0
#define _PIE7_CWG1IE_POSITION                               0x0
#define _PIE7_CWG1IE_SIZE                                   0x1
#define _PIE7_CWG1IE_LENGTH                                 0x1
#define _PIE7_CWG1IE_MASK                                   0x1
#define _PIE7_CWG2IE_POSN                                   0x1
#define _PIE7_CWG2IE_POSITION                               0x1
#define _PIE7_CWG2IE_SIZE                                   0x1
#define _PIE7_CWG2IE_LENGTH                                 0x1
#define _PIE7_CWG2IE_MASK                                   0x2
#define _PIE7_CWG3IE_POSN                                   0x2
#define _PIE7_CWG3IE_POSITION                               0x2
#define _PIE7_CWG3IE_SIZE                                   0x1
#define _PIE7_CWG3IE_LENGTH                                 0x1
#define _PIE7_CWG3IE_MASK                                   0x4
#define _PIE7_NCO1IE_POSN                                   0x4
#define _PIE7_NCO1IE_POSITION                               0x4
#define _PIE7_NCO1IE_SIZE                                   0x1
#define _PIE7_NCO1IE_LENGTH                                 0x1
#define _PIE7_NCO1IE_MASK                                   0x10
#define _PIE7_NVMIE_POSN                                    0x5
#define _PIE7_NVMIE_POSITION                                0x5
#define _PIE7_NVMIE_SIZE                                    0x1
#define _PIE7_NVMIE_LENGTH                                  0x1
#define _PIE7_NVMIE_MASK                                    0x20
#define _PIE7_CRCIE_POSN                                    0x6
#define _PIE7_CRCIE_POSITION                                0x6
#define _PIE7_CRCIE_SIZE                                    0x1
#define _PIE7_CRCIE_LENGTH                                  0x1
#define _PIE7_CRCIE_MASK                                    0x40
#define _PIE7_SCANIE_POSN                                   0x7
#define _PIE7_SCANIE_POSITION                               0x7
#define _PIE7_SCANIE_SIZE                                   0x1
#define _PIE7_SCANIE_LENGTH                                 0x1
#define _PIE7_SCANIE_MASK                                   0x80
#define _PIE7_NCOIE_POSN                                    0x4
#define _PIE7_NCOIE_POSITION                                0x4
#define _PIE7_NCOIE_SIZE                                    0x1
#define _PIE7_NCOIE_LENGTH                                  0x1
#define _PIE7_NCOIE_MASK                                    0x10

// Register: PIE8
#define PIE8 PIE8
extern volatile unsigned char           PIE8                __at(0x71E);
#ifndef _LIB_BUILD
asm("PIE8 equ 071Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SMT1IE                 :1;
        unsigned SMT1PRAIE              :1;
        unsigned SMT1PWAIE              :1;
        unsigned SMT2IE                 :1;
        unsigned SMT2PRAIE              :1;
        unsigned SMT2PWAIE              :1;
    };
} PIE8bits_t;
extern volatile PIE8bits_t PIE8bits __at(0x71E);
// bitfield macros
#define _PIE8_SMT1IE_POSN                                   0x0
#define _PIE8_SMT1IE_POSITION                               0x0
#define _PIE8_SMT1IE_SIZE                                   0x1
#define _PIE8_SMT1IE_LENGTH                                 0x1
#define _PIE8_SMT1IE_MASK                                   0x1
#define _PIE8_SMT1PRAIE_POSN                                0x1
#define _PIE8_SMT1PRAIE_POSITION                            0x1
#define _PIE8_SMT1PRAIE_SIZE                                0x1
#define _PIE8_SMT1PRAIE_LENGTH                              0x1
#define _PIE8_SMT1PRAIE_MASK                                0x2
#define _PIE8_SMT1PWAIE_POSN                                0x2
#define _PIE8_SMT1PWAIE_POSITION                            0x2
#define _PIE8_SMT1PWAIE_SIZE                                0x1
#define _PIE8_SMT1PWAIE_LENGTH                              0x1
#define _PIE8_SMT1PWAIE_MASK                                0x4
#define _PIE8_SMT2IE_POSN                                   0x3
#define _PIE8_SMT2IE_POSITION                               0x3
#define _PIE8_SMT2IE_SIZE                                   0x1
#define _PIE8_SMT2IE_LENGTH                                 0x1
#define _PIE8_SMT2IE_MASK                                   0x8
#define _PIE8_SMT2PRAIE_POSN                                0x4
#define _PIE8_SMT2PRAIE_POSITION                            0x4
#define _PIE8_SMT2PRAIE_SIZE                                0x1
#define _PIE8_SMT2PRAIE_LENGTH                              0x1
#define _PIE8_SMT2PRAIE_MASK                                0x10
#define _PIE8_SMT2PWAIE_POSN                                0x5
#define _PIE8_SMT2PWAIE_POSITION                            0x5
#define _PIE8_SMT2PWAIE_SIZE                                0x1
#define _PIE8_SMT2PWAIE_LENGTH                              0x1
#define _PIE8_SMT2PWAIE_MASK                                0x20

