GopalSaraf/Practicals/PSDL/include/proc/pic16lf18857.h
extern volatile __bit                   CAL33               __at(0x1093);	// @ (0x212 * 8 + 3)
#define                                 CAL33_bit           _BIT_ACCESS(TMR3L,3)
// TMR5L<CAL35>
extern volatile __bit                   CAL35               __at(0x10C3);	// @ (0x218 * 8 + 3)
#define                                 CAL35_bit           _BIT_ACCESS(TMR5L,3)
// TMR1L<CAL41>
extern volatile __bit                   CAL41               __at(0x1064);	// @ (0x20C * 8 + 4)
#define                                 CAL41_bit           _BIT_ACCESS(TMR1L,4)
// TMR3L<CAL43>
extern volatile __bit                   CAL43               __at(0x1094);	// @ (0x212 * 8 + 4)
#define                                 CAL43_bit           _BIT_ACCESS(TMR3L,4)
// TMR5L<CAL45>
extern volatile __bit                   CAL45               __at(0x10C4);	// @ (0x218 * 8 + 4)
#define                                 CAL45_bit           _BIT_ACCESS(TMR5L,4)
// TMR1L<CAL51>
extern volatile __bit                   CAL51               __at(0x1065);	// @ (0x20C * 8 + 5)
#define                                 CAL51_bit           _BIT_ACCESS(TMR1L,5)
// TMR3L<CAL53>
extern volatile __bit                   CAL53               __at(0x1095);	// @ (0x212 * 8 + 5)
#define                                 CAL53_bit           _BIT_ACCESS(TMR3L,5)
// TMR5L<CAL55>
extern volatile __bit                   CAL55               __at(0x10C5);	// @ (0x218 * 8 + 5)
#define                                 CAL55_bit           _BIT_ACCESS(TMR5L,5)
// TMR1L<CAL61>
extern volatile __bit                   CAL61               __at(0x1066);	// @ (0x20C * 8 + 6)
#define                                 CAL61_bit           _BIT_ACCESS(TMR1L,6)
// TMR3L<CAL63>
extern volatile __bit                   CAL63               __at(0x1096);	// @ (0x212 * 8 + 6)
#define                                 CAL63_bit           _BIT_ACCESS(TMR3L,6)
// TMR5L<CAL65>
extern volatile __bit                   CAL65               __at(0x10C6);	// @ (0x218 * 8 + 6)
#define                                 CAL65_bit           _BIT_ACCESS(TMR5L,6)
// TMR1L<CAL71>
extern volatile __bit                   CAL71               __at(0x1067);	// @ (0x20C * 8 + 7)
#define                                 CAL71_bit           _BIT_ACCESS(TMR1L,7)
// TMR3L<CAL73>
extern volatile __bit                   CAL73               __at(0x1097);	// @ (0x212 * 8 + 7)
#define                                 CAL73_bit           _BIT_ACCESS(TMR3L,7)
// TMR5L<CAL75>
extern volatile __bit                   CAL75               __at(0x10C7);	// @ (0x218 * 8 + 7)
#define                                 CAL75_bit           _BIT_ACCESS(TMR5L,7)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x18);	// @ (0x3 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// CCDCON<CCDEN>
extern volatile __bit                   CCDEN               __at(0x40A7);	// @ (0x814 * 8 + 7)
#define                                 CCDEN_bit           _BIT_ACCESS(CCDCON,7)
// CCDNA<CCDNA0>
extern volatile __bit                   CCDNA0              __at(0xFA00);	// @ (0x1F40 * 8 + 0)
#define                                 CCDNA0_bit          _BIT_ACCESS(CCDNA,0)
// CCDNA<CCDNA1>
extern volatile __bit                   CCDNA1              __at(0xFA01);	// @ (0x1F40 * 8 + 1)
#define                                 CCDNA1_bit          _BIT_ACCESS(CCDNA,1)
// CCDNA<CCDNA2>
extern volatile __bit                   CCDNA2              __at(0xFA02);	// @ (0x1F40 * 8 + 2)
#define                                 CCDNA2_bit          _BIT_ACCESS(CCDNA,2)
// CCDNA<CCDNA3>
extern volatile __bit                   CCDNA3              __at(0xFA03);	// @ (0x1F40 * 8 + 3)
#define                                 CCDNA3_bit          _BIT_ACCESS(CCDNA,3)
// CCDNA<CCDNA4>
extern volatile __bit                   CCDNA4              __at(0xFA04);	// @ (0x1F40 * 8 + 4)
#define                                 CCDNA4_bit          _BIT_ACCESS(CCDNA,4)
// CCDNA<CCDNA5>
extern volatile __bit                   CCDNA5              __at(0xFA05);	// @ (0x1F40 * 8 + 5)
#define                                 CCDNA5_bit          _BIT_ACCESS(CCDNA,5)
// CCDNA<CCDNA6>
extern volatile __bit                   CCDNA6              __at(0xFA06);	// @ (0x1F40 * 8 + 6)
#define                                 CCDNA6_bit          _BIT_ACCESS(CCDNA,6)
// CCDNA<CCDNA7>
extern volatile __bit                   CCDNA7              __at(0xFA07);	// @ (0x1F40 * 8 + 7)
#define                                 CCDNA7_bit          _BIT_ACCESS(CCDNA,7)
// CCDNB<CCDNB0>
extern volatile __bit                   CCDNB0              __at(0xFA58);	// @ (0x1F4B * 8 + 0)
#define                                 CCDNB0_bit          _BIT_ACCESS(CCDNB,0)
// CCDNB<CCDNB1>
extern volatile __bit                   CCDNB1              __at(0xFA59);	// @ (0x1F4B * 8 + 1)
#define                                 CCDNB1_bit          _BIT_ACCESS(CCDNB,1)
// CCDNB<CCDNB2>
extern volatile __bit                   CCDNB2              __at(0xFA5A);	// @ (0x1F4B * 8 + 2)
#define                                 CCDNB2_bit          _BIT_ACCESS(CCDNB,2)
// CCDNB<CCDNB3>
extern volatile __bit                   CCDNB3              __at(0xFA5B);	// @ (0x1F4B * 8 + 3)
#define                                 CCDNB3_bit          _BIT_ACCESS(CCDNB,3)
// CCDNB<CCDNB4>
extern volatile __bit                   CCDNB4              __at(0xFA5C);	// @ (0x1F4B * 8 + 4)
#define                                 CCDNB4_bit          _BIT_ACCESS(CCDNB,4)
// CCDNB<CCDNB5>
extern volatile __bit                   CCDNB5              __at(0xFA5D);	// @ (0x1F4B * 8 + 5)
#define                                 CCDNB5_bit          _BIT_ACCESS(CCDNB,5)
// CCDNB<CCDNB6>
extern volatile __bit                   CCDNB6              __at(0xFA5E);	// @ (0x1F4B * 8 + 6)
#define                                 CCDNB6_bit          _BIT_ACCESS(CCDNB,6)
// CCDNB<CCDNB7>
extern volatile __bit                   CCDNB7              __at(0xFA5F);	// @ (0x1F4B * 8 + 7)
#define                                 CCDNB7_bit          _BIT_ACCESS(CCDNB,7)
// CCDNC<CCDNC0>
extern volatile __bit                   CCDNC0              __at(0xFAB0);	// @ (0x1F56 * 8 + 0)
#define                                 CCDNC0_bit          _BIT_ACCESS(CCDNC,0)
// CCDNC<CCDNC1>
extern volatile __bit                   CCDNC1              __at(0xFAB1);	// @ (0x1F56 * 8 + 1)
#define                                 CCDNC1_bit          _BIT_ACCESS(CCDNC,1)
// CCDNC<CCDNC2>
extern volatile __bit                   CCDNC2              __at(0xFAB2);	// @ (0x1F56 * 8 + 2)
#define                                 CCDNC2_bit          _BIT_ACCESS(CCDNC,2)
// CCDNC<CCDNC3>
extern volatile __bit                   CCDNC3              __at(0xFAB3);	// @ (0x1F56 * 8 + 3)
#define                                 CCDNC3_bit          _BIT_ACCESS(CCDNC,3)
// CCDNC<CCDNC4>
extern volatile __bit                   CCDNC4              __at(0xFAB4);	// @ (0x1F56 * 8 + 4)
#define                                 CCDNC4_bit          _BIT_ACCESS(CCDNC,4)
// CCDNC<CCDNC5>
extern volatile __bit                   CCDNC5              __at(0xFAB5);	// @ (0x1F56 * 8 + 5)
#define                                 CCDNC5_bit          _BIT_ACCESS(CCDNC,5)
// CCDNC<CCDNC6>
extern volatile __bit                   CCDNC6              __at(0xFAB6);	// @ (0x1F56 * 8 + 6)
#define                                 CCDNC6_bit          _BIT_ACCESS(CCDNC,6)
// CCDNC<CCDNC7>
extern volatile __bit                   CCDNC7              __at(0xFAB7);	// @ (0x1F56 * 8 + 7)
#define                                 CCDNC7_bit          _BIT_ACCESS(CCDNC,7)
// CCDPA<CCDPA0>
extern volatile __bit                   CCDPA0              __at(0xFA08);	// @ (0x1F41 * 8 + 0)
#define                                 CCDPA0_bit          _BIT_ACCESS(CCDPA,0)
// CCDPA<CCDPA1>
extern volatile __bit                   CCDPA1              __at(0xFA09);	// @ (0x1F41 * 8 + 1)
#define                                 CCDPA1_bit          _BIT_ACCESS(CCDPA,1)
// CCDPA<CCDPA2>
extern volatile __bit                   CCDPA2              __at(0xFA0A);	// @ (0x1F41 * 8 + 2)
#define                                 CCDPA2_bit          _BIT_ACCESS(CCDPA,2)
// CCDPA<CCDPA3>
extern volatile __bit                   CCDPA3              __at(0xFA0B);	// @ (0x1F41 * 8 + 3)
#define                                 CCDPA3_bit          _BIT_ACCESS(CCDPA,3)
// CCDPA<CCDPA4>
extern volatile __bit                   CCDPA4              __at(0xFA0C);	// @ (0x1F41 * 8 + 4)
#define                                 CCDPA4_bit          _BIT_ACCESS(CCDPA,4)
// CCDPA<CCDPA5>
extern volatile __bit                   CCDPA5              __at(0xFA0D);	// @ (0x1F41 * 8 + 5)
#define                                 CCDPA5_bit          _BIT_ACCESS(CCDPA,5)
// CCDPA<CCDPA6>
extern volatile __bit                   CCDPA6              __at(0xFA0E);	// @ (0x1F41 * 8 + 6)
#define                                 CCDPA6_bit          _BIT_ACCESS(CCDPA,6)
// CCDPA<CCDPA7>
extern volatile __bit                   CCDPA7              __at(0xFA0F);	// @ (0x1F41 * 8 + 7)
#define                                 CCDPA7_bit          _BIT_ACCESS(CCDPA,7)
// CCDPB<CCDPB0>
extern volatile __bit                   CCDPB0              __at(0xFA60);	// @ (0x1F4C * 8 + 0)
#define                                 CCDPB0_bit          _BIT_ACCESS(CCDPB,0)
// CCDPB<CCDPB1>
extern volatile __bit                   CCDPB1              __at(0xFA61);	// @ (0x1F4C * 8 + 1)
#define                                 CCDPB1_bit          _BIT_ACCESS(CCDPB,1)
// CCDPB<CCDPB2>
extern volatile __bit                   CCDPB2              __at(0xFA62);	// @ (0x1F4C * 8 + 2)
#define                                 CCDPB2_bit          _BIT_ACCESS(CCDPB,2)
// CCDPB<CCDPB3>
extern volatile __bit                   CCDPB3              __at(0xFA63);	// @ (0x1F4C * 8 + 3)
#define                                 CCDPB3_bit          _BIT_ACCESS(CCDPB,3)
// CCDPB<CCDPB4>
extern volatile __bit                   CCDPB4              __at(0xFA64);	// @ (0x1F4C * 8 + 4)
#define                                 CCDPB4_bit          _BIT_ACCESS(CCDPB,4)
// CCDPB<CCDPB5>
extern volatile __bit                   CCDPB5              __at(0xFA65);	// @ (0x1F4C * 8 + 5)
#define                                 CCDPB5_bit          _BIT_ACCESS(CCDPB,5)
// CCDPB<CCDPB6>
extern volatile __bit                   CCDPB6              __at(0xFA66);	// @ (0x1F4C * 8 + 6)
#define                                 CCDPB6_bit          _BIT_ACCESS(CCDPB,6)
// CCDPB<CCDPB7>
extern volatile __bit                   CCDPB7              __at(0xFA67);	// @ (0x1F4C * 8 + 7)
#define                                 CCDPB7_bit          _BIT_ACCESS(CCDPB,7)
// CCDPC<CCDPC0>
extern volatile __bit                   CCDPC0              __at(0xFAB8);	// @ (0x1F57 * 8 + 0)
#define                                 CCDPC0_bit          _BIT_ACCESS(CCDPC,0)
// CCDPC<CCDPC1>
extern volatile __bit                   CCDPC1              __at(0xFAB9);	// @ (0x1F57 * 8 + 1)
#define                                 CCDPC1_bit          _BIT_ACCESS(CCDPC,1)
// CCDPC<CCDPC2>
extern volatile __bit                   CCDPC2              __at(0xFABA);	// @ (0x1F57 * 8 + 2)
#define                                 CCDPC2_bit          _BIT_ACCESS(CCDPC,2)
// CCDPC<CCDPC3>
extern volatile __bit                   CCDPC3              __at(0xFABB);	// @ (0x1F57 * 8 + 3)
#define                                 CCDPC3_bit          _BIT_ACCESS(CCDPC,3)
// CCDPC<CCDPC4>
extern volatile __bit                   CCDPC4              __at(0xFABC);	// @ (0x1F57 * 8 + 4)
#define                                 CCDPC4_bit          _BIT_ACCESS(CCDPC,4)
// CCDPC<CCDPC5>
extern volatile __bit                   CCDPC5              __at(0xFABD);	// @ (0x1F57 * 8 + 5)
#define                                 CCDPC5_bit          _BIT_ACCESS(CCDPC,5)
// CCDPC<CCDPC6>
extern volatile __bit                   CCDPC6              __at(0xFABE);	// @ (0x1F57 * 8 + 6)
#define                                 CCDPC6_bit          _BIT_ACCESS(CCDPC,6)
// CCDPC<CCDPC7>
extern volatile __bit                   CCDPC7              __at(0xFABF);	// @ (0x1F57 * 8 + 7)
#define                                 CCDPC7_bit          _BIT_ACCESS(CCDPC,7)
// CCDCON<CCDS0>
extern volatile __bit                   CCDS0               __at(0x40A0);	// @ (0x814 * 8 + 0)
#define                                 CCDS0_bit           _BIT_ACCESS(CCDCON,0)
// CCDCON<CCDS1>
extern volatile __bit                   CCDS1               __at(0x40A1);	// @ (0x814 * 8 + 1)
#define                                 CCDS1_bit           _BIT_ACCESS(CCDCON,1)
// CCP1CAP<CCP1CTS0>
extern volatile __bit                   CCP1CTS0            __at(0x1878);	// @ (0x30F * 8 + 0)
#define                                 CCP1CTS0_bit        _BIT_ACCESS(CCP1CAP,0)
// CCP1CAP<CCP1CTS1>
extern volatile __bit                   CCP1CTS1            __at(0x1879);	// @ (0x30F * 8 + 1)
#define                                 CCP1CTS1_bit        _BIT_ACCESS(CCP1CAP,1)
// CCP1CAP<CCP1CTS2>
extern volatile __bit                   CCP1CTS2            __at(0x187A);	// @ (0x30F * 8 + 2)
#define                                 CCP1CTS2_bit        _BIT_ACCESS(CCP1CAP,2)
// CCP1CON<CCP1EN>
extern volatile __bit                   CCP1EN              __at(0x1877);	// @ (0x30E * 8 + 7)
#define                                 CCP1EN_bit          _BIT_ACCESS(CCP1CON,7)
// CCP1CON<CCP1FMT>
extern volatile __bit                   CCP1FMT             __at(0x1874);	// @ (0x30E * 8 + 4)
#define                                 CCP1FMT_bit         _BIT_ACCESS(CCP1CON,4)
// PIE6<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x38E0);	// @ (0x71C * 8 + 0)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE6,0)
// PIR6<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x3890);	// @ (0x712 * 8 + 0)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR6,0)
// PMD3<CCP1MD>
extern volatile __bit                   CCP1MD              __at(0x3CC8);	// @ (0x799 * 8 + 0)
#define                                 CCP1MD_bit          _BIT_ACCESS(PMD3,0)
// CCP1CON<CCP1MODE0>
extern volatile __bit                   CCP1MODE0           __at(0x1870);	// @ (0x30E * 8 + 0)
#define                                 CCP1MODE0_bit       _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1MODE1>
extern volatile __bit                   CCP1MODE1           __at(0x1871);	// @ (0x30E * 8 + 1)
#define                                 CCP1MODE1_bit       _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1MODE2>
extern volatile __bit                   CCP1MODE2           __at(0x1872);	// @ (0x30E * 8 + 2)
#define                                 CCP1MODE2_bit       _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1MODE3>
extern volatile __bit                   CCP1MODE3           __at(0x1873);	// @ (0x30E * 8 + 3)
#define                                 CCP1MODE3_bit       _BIT_ACCESS(CCP1CON,3)
// CCP1CON<CCP1OUT>
extern volatile __bit                   CCP1OUT             __at(0x1875);	// @ (0x30E * 8 + 5)
#define                                 CCP1OUT_bit         _BIT_ACCESS(CCP1CON,5)
// CCP1PPS<CCP1PPS0>
extern volatile __bit                   CCP1PPS0            __at(0xF508);	// @ (0x1EA1 * 8 + 0)
#define                                 CCP1PPS0_bit        _BIT_ACCESS(CCP1PPS,0)
// CCP1PPS<CCP1PPS1>
extern volatile __bit                   CCP1PPS1            __at(0xF509);	// @ (0x1EA1 * 8 + 1)
#define                                 CCP1PPS1_bit        _BIT_ACCESS(CCP1PPS,1)
// CCP1PPS<CCP1PPS2>
extern volatile __bit                   CCP1PPS2            __at(0xF50A);	// @ (0x1EA1 * 8 + 2)
#define                                 CCP1PPS2_bit        _BIT_ACCESS(CCP1PPS,2)
// CCP1PPS<CCP1PPS3>
extern volatile __bit                   CCP1PPS3            __at(0xF50B);	// @ (0x1EA1 * 8 + 3)
#define                                 CCP1PPS3_bit        _BIT_ACCESS(CCP1PPS,3)
// CCP1PPS<CCP1PPS4>
extern volatile __bit                   CCP1PPS4            __at(0xF50C);	// @ (0x1EA1 * 8 + 4)
#define                                 CCP1PPS4_bit        _BIT_ACCESS(CCP1PPS,4)
// CCP2CAP<CCP2CTS0>
extern volatile __bit                   CCP2CTS0            __at(0x1898);	// @ (0x313 * 8 + 0)
#define                                 CCP2CTS0_bit        _BIT_ACCESS(CCP2CAP,0)
// CCP2CAP<CCP2CTS1>
extern volatile __bit                   CCP2CTS1            __at(0x1899);	// @ (0x313 * 8 + 1)
#define                                 CCP2CTS1_bit        _BIT_ACCESS(CCP2CAP,1)
// CCP2CAP<CCP2CTS2>
extern volatile __bit                   CCP2CTS2            __at(0x189A);	// @ (0x313 * 8 + 2)
#define                                 CCP2CTS2_bit        _BIT_ACCESS(CCP2CAP,2)
// CCP2CON<CCP2EN>
extern volatile __bit                   CCP2EN              __at(0x1897);	// @ (0x312 * 8 + 7)
#define                                 CCP2EN_bit          _BIT_ACCESS(CCP2CON,7)
// CCP2CON<CCP2FMT>
extern volatile __bit                   CCP2FMT             __at(0x1894);	// @ (0x312 * 8 + 4)
#define                                 CCP2FMT_bit         _BIT_ACCESS(CCP2CON,4)
// PIE6<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x38E1);	// @ (0x71C * 8 + 1)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE6,1)
// PIR6<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x3891);	// @ (0x712 * 8 + 1)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR6,1)
// PMD3<CCP2MD>
extern volatile __bit                   CCP2MD              __at(0x3CC9);	// @ (0x799 * 8 + 1)
#define                                 CCP2MD_bit          _BIT_ACCESS(PMD3,1)
// CCP2CON<CCP2MODE0>
extern volatile __bit                   CCP2MODE0           __at(0x1890);	// @ (0x312 * 8 + 0)
#define                                 CCP2MODE0_bit       _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2MODE1>
extern volatile __bit                   CCP2MODE1           __at(0x1891);	// @ (0x312 * 8 + 1)
#define                                 CCP2MODE1_bit       _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2MODE2>
extern volatile __bit                   CCP2MODE2           __at(0x1892);	// @ (0x312 * 8 + 2)
#define                                 CCP2MODE2_bit       _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2MODE3>
extern volatile __bit                   CCP2MODE3           __at(0x1893);	// @ (0x312 * 8 + 3)
#define                                 CCP2MODE3_bit       _BIT_ACCESS(CCP2CON,3)
// CCP2CON<CCP2OUT>
extern volatile __bit                   CCP2OUT             __at(0x1895);	// @ (0x312 * 8 + 5)
#define                                 CCP2OUT_bit         _BIT_ACCESS(CCP2CON,5)
// CCP2PPS<CCP2PPS0>
extern volatile __bit                   CCP2PPS0            __at(0xF510);	// @ (0x1EA2 * 8 + 0)
#define                                 CCP2PPS0_bit        _BIT_ACCESS(CCP2PPS,0)
// CCP2PPS<CCP2PPS1>
extern volatile __bit                   CCP2PPS1            __at(0xF511);	// @ (0x1EA2 * 8 + 1)
#define                                 CCP2PPS1_bit        _BIT_ACCESS(CCP2PPS,1)
// CCP2PPS<CCP2PPS2>
extern volatile __bit                   CCP2PPS2            __at(0xF512);	// @ (0x1EA2 * 8 + 2)
#define                                 CCP2PPS2_bit        _BIT_ACCESS(CCP2PPS,2)
// CCP2PPS<CCP2PPS3>
extern volatile __bit                   CCP2PPS3            __at(0xF513);	// @ (0x1EA2 * 8 + 3)
#define                                 CCP2PPS3_bit        _BIT_ACCESS(CCP2PPS,3)
// CCP2PPS<CCP2PPS4>
extern volatile __bit                   CCP2PPS4            __at(0xF514);	// @ (0x1EA2 * 8 + 4)
#define                                 CCP2PPS4_bit        _BIT_ACCESS(CCP2PPS,4)
// CCP3CAP<CCP3CTS0>
extern volatile __bit                   CCP3CTS0            __at(0x18B8);	// @ (0x317 * 8 + 0)
#define                                 CCP3CTS0_bit        _BIT_ACCESS(CCP3CAP,0)
// CCP3CAP<CCP3CTS1>
extern volatile __bit                   CCP3CTS1            __at(0x18B9);	// @ (0x317 * 8 + 1)
#define                                 CCP3CTS1_bit        _BIT_ACCESS(CCP3CAP,1)
// CCP3CAP<CCP3CTS2>
extern volatile __bit                   CCP3CTS2            __at(0x18BA);	// @ (0x317 * 8 + 2)
#define                                 CCP3CTS2_bit        _BIT_ACCESS(CCP3CAP,2)
// CCP3CON<CCP3EN>
extern volatile __bit                   CCP3EN              __at(0x18B7);	// @ (0x316 * 8 + 7)
#define                                 CCP3EN_bit          _BIT_ACCESS(CCP3CON,7)
// CCP3CON<CCP3FMT>
extern volatile __bit                   CCP3FMT             __at(0x18B4);	// @ (0x316 * 8 + 4)
#define                                 CCP3FMT_bit         _BIT_ACCESS(CCP3CON,4)
// PIE6<CCP3IE>
extern volatile __bit                   CCP3IE              __at(0x38E2);	// @ (0x71C * 8 + 2)
#define                                 CCP3IE_bit          _BIT_ACCESS(PIE6,2)
// PIR6<CCP3IF>
extern volatile __bit                   CCP3IF              __at(0x3892);	// @ (0x712 * 8 + 2)
#define                                 CCP3IF_bit          _BIT_ACCESS(PIR6,2)
// PMD3<CCP3MD>
extern volatile __bit                   CCP3MD              __at(0x3CCA);	// @ (0x799 * 8 + 2)
#define                                 CCP3MD_bit          _BIT_ACCESS(PMD3,2)
// CCP3CON<CCP3MODE0>
extern volatile __bit                   CCP3MODE0           __at(0x18B0);	// @ (0x316 * 8 + 0)
#define                                 CCP3MODE0_bit       _BIT_ACCESS(CCP3CON,0)
// CCP3CON<CCP3MODE1>
extern volatile __bit                   CCP3MODE1           __at(0x18B1);	// @ (0x316 * 8 + 1)
#define                                 CCP3MODE1_bit       _BIT_ACCESS(CCP3CON,1)
// CCP3CON<CCP3MODE2>
extern volatile __bit                   CCP3MODE2           __at(0x18B2);	// @ (0x316 * 8 + 2)
#define                                 CCP3MODE2_bit       _BIT_ACCESS(CCP3CON,2)
// CCP3CON<CCP3MODE3>
extern volatile __bit                   CCP3MODE3           __at(0x18B3);	// @ (0x316 * 8 + 3)
#define                                 CCP3MODE3_bit       _BIT_ACCESS(CCP3CON,3)
// CCP3CON<CCP3OUT>
extern volatile __bit                   CCP3OUT             __at(0x18B5);	// @ (0x316 * 8 + 5)
#define                                 CCP3OUT_bit         _BIT_ACCESS(CCP3CON,5)
// CCP3PPS<CCP3PPS0>
extern volatile __bit                   CCP3PPS0            __at(0xF518);	// @ (0x1EA3 * 8 + 0)
#define                                 CCP3PPS0_bit        _BIT_ACCESS(CCP3PPS,0)
// CCP3PPS<CCP3PPS1>
extern volatile __bit                   CCP3PPS1            __at(0xF519);	// @ (0x1EA3 * 8 + 1)
#define                                 CCP3PPS1_bit        _BIT_ACCESS(CCP3PPS,1)
// CCP3PPS<CCP3PPS2>
extern volatile __bit                   CCP3PPS2            __at(0xF51A);	// @ (0x1EA3 * 8 + 2)
#define                                 CCP3PPS2_bit        _BIT_ACCESS(CCP3PPS,2)
// CCP3PPS<CCP3PPS3>
extern volatile __bit                   CCP3PPS3            __at(0xF51B);	// @ (0x1EA3 * 8 + 3)
#define                                 CCP3PPS3_bit        _BIT_ACCESS(CCP3PPS,3)
// CCP3PPS<CCP3PPS4>
extern volatile __bit                   CCP3PPS4            __at(0xF51C);	// @ (0x1EA3 * 8 + 4)
#define                                 CCP3PPS4_bit        _BIT_ACCESS(CCP3PPS,4)
// CCP4CAP<CCP4CTS0>
extern volatile __bit                   CCP4CTS0            __at(0x18D8);	// @ (0x31B * 8 + 0)
#define                                 CCP4CTS0_bit        _BIT_ACCESS(CCP4CAP,0)
// CCP4CAP<CCP4CTS1>
extern volatile __bit                   CCP4CTS1            __at(0x18D9);	// @ (0x31B * 8 + 1)
#define                                 CCP4CTS1_bit        _BIT_ACCESS(CCP4CAP,1)
// CCP4CAP<CCP4CTS2>
extern volatile __bit                   CCP4CTS2            __at(0x18DA);	// @ (0x31B * 8 + 2)
