GopalSaraf/Practicals/PSDL/include/proc/pic16lf18857.h
#define                                 LC3INTP_bit         _BIT_ACCESS(CLC3CON,4)
// CLC3CON<LC3MODE0>
extern volatile __bit                   LC3MODE0            __at(0xF120);	// @ (0x1E24 * 8 + 0)
#define                                 LC3MODE0_bit        _BIT_ACCESS(CLC3CON,0)
// CLC3CON<LC3MODE1>
extern volatile __bit                   LC3MODE1            __at(0xF121);	// @ (0x1E24 * 8 + 1)
#define                                 LC3MODE1_bit        _BIT_ACCESS(CLC3CON,1)
// CLC3CON<LC3MODE2>
extern volatile __bit                   LC3MODE2            __at(0xF122);	// @ (0x1E24 * 8 + 2)
#define                                 LC3MODE2_bit        _BIT_ACCESS(CLC3CON,2)
// CLC3CON<LC3OUT>
extern volatile __bit                   LC3OUT              __at(0xF125);	// @ (0x1E24 * 8 + 5)
#define                                 LC3OUT_bit          _BIT_ACCESS(CLC3CON,5)
// CLC3POL<LC3POL>
extern volatile __bit                   LC3POL              __at(0xF12F);	// @ (0x1E25 * 8 + 7)
#define                                 LC3POL_bit          _BIT_ACCESS(CLC3POL,7)
// CLC4SEL0<LC4D1S0>
extern volatile __bit                   LC4D1S0             __at(0xF180);	// @ (0x1E30 * 8 + 0)
#define                                 LC4D1S0_bit         _BIT_ACCESS(CLC4SEL0,0)
// CLC4SEL0<LC4D1S1>
extern volatile __bit                   LC4D1S1             __at(0xF181);	// @ (0x1E30 * 8 + 1)
#define                                 LC4D1S1_bit         _BIT_ACCESS(CLC4SEL0,1)
// CLC4SEL0<LC4D1S2>
extern volatile __bit                   LC4D1S2             __at(0xF182);	// @ (0x1E30 * 8 + 2)
#define                                 LC4D1S2_bit         _BIT_ACCESS(CLC4SEL0,2)
// CLC4SEL0<LC4D1S3>
extern volatile __bit                   LC4D1S3             __at(0xF183);	// @ (0x1E30 * 8 + 3)
#define                                 LC4D1S3_bit         _BIT_ACCESS(CLC4SEL0,3)
// CLC4SEL0<LC4D1S4>
extern volatile __bit                   LC4D1S4             __at(0xF184);	// @ (0x1E30 * 8 + 4)
#define                                 LC4D1S4_bit         _BIT_ACCESS(CLC4SEL0,4)
// CLC4SEL0<LC4D1S5>
extern volatile __bit                   LC4D1S5             __at(0xF185);	// @ (0x1E30 * 8 + 5)
#define                                 LC4D1S5_bit         _BIT_ACCESS(CLC4SEL0,5)
// CLC4SEL0<LC4D1S6>
extern volatile __bit                   LC4D1S6             __at(0xF186);	// @ (0x1E30 * 8 + 6)
#define                                 LC4D1S6_bit         _BIT_ACCESS(CLC4SEL0,6)
// CLC4SEL0<LC4D1S7>
extern volatile __bit                   LC4D1S7             __at(0xF187);	// @ (0x1E30 * 8 + 7)
#define                                 LC4D1S7_bit         _BIT_ACCESS(CLC4SEL0,7)
// CLC4SEL1<LC4D2S0>
extern volatile __bit                   LC4D2S0             __at(0xF188);	// @ (0x1E31 * 8 + 0)
#define                                 LC4D2S0_bit         _BIT_ACCESS(CLC4SEL1,0)
// CLC4SEL1<LC4D2S1>
extern volatile __bit                   LC4D2S1             __at(0xF189);	// @ (0x1E31 * 8 + 1)
#define                                 LC4D2S1_bit         _BIT_ACCESS(CLC4SEL1,1)
// CLC4SEL1<LC4D2S2>
extern volatile __bit                   LC4D2S2             __at(0xF18A);	// @ (0x1E31 * 8 + 2)
#define                                 LC4D2S2_bit         _BIT_ACCESS(CLC4SEL1,2)
// CLC4SEL1<LC4D2S3>
extern volatile __bit                   LC4D2S3             __at(0xF18B);	// @ (0x1E31 * 8 + 3)
#define                                 LC4D2S3_bit         _BIT_ACCESS(CLC4SEL1,3)
// CLC4SEL1<LC4D2S4>
extern volatile __bit                   LC4D2S4             __at(0xF18C);	// @ (0x1E31 * 8 + 4)
#define                                 LC4D2S4_bit         _BIT_ACCESS(CLC4SEL1,4)
// CLC4SEL1<LC4D2S5>
extern volatile __bit                   LC4D2S5             __at(0xF18D);	// @ (0x1E31 * 8 + 5)
#define                                 LC4D2S5_bit         _BIT_ACCESS(CLC4SEL1,5)
// CLC4SEL1<LC4D2S6>
extern volatile __bit                   LC4D2S6             __at(0xF18E);	// @ (0x1E31 * 8 + 6)
#define                                 LC4D2S6_bit         _BIT_ACCESS(CLC4SEL1,6)
// CLC4SEL1<LC4D2S7>
extern volatile __bit                   LC4D2S7             __at(0xF18F);	// @ (0x1E31 * 8 + 7)
#define                                 LC4D2S7_bit         _BIT_ACCESS(CLC4SEL1,7)
// CLC4SEL2<LC4D3S0>
extern volatile __bit                   LC4D3S0             __at(0xF190);	// @ (0x1E32 * 8 + 0)
#define                                 LC4D3S0_bit         _BIT_ACCESS(CLC4SEL2,0)
// CLC4SEL2<LC4D3S1>
extern volatile __bit                   LC4D3S1             __at(0xF191);	// @ (0x1E32 * 8 + 1)
#define                                 LC4D3S1_bit         _BIT_ACCESS(CLC4SEL2,1)
// CLC4SEL2<LC4D3S2>
extern volatile __bit                   LC4D3S2             __at(0xF192);	// @ (0x1E32 * 8 + 2)
#define                                 LC4D3S2_bit         _BIT_ACCESS(CLC4SEL2,2)
// CLC4SEL2<LC4D3S3>
extern volatile __bit                   LC4D3S3             __at(0xF193);	// @ (0x1E32 * 8 + 3)
#define                                 LC4D3S3_bit         _BIT_ACCESS(CLC4SEL2,3)
// CLC4SEL2<LC4D3S4>
extern volatile __bit                   LC4D3S4             __at(0xF194);	// @ (0x1E32 * 8 + 4)
#define                                 LC4D3S4_bit         _BIT_ACCESS(CLC4SEL2,4)
// CLC4SEL2<LC4D3S5>
extern volatile __bit                   LC4D3S5             __at(0xF195);	// @ (0x1E32 * 8 + 5)
#define                                 LC4D3S5_bit         _BIT_ACCESS(CLC4SEL2,5)
// CLC4SEL2<LC4D3S6>
extern volatile __bit                   LC4D3S6             __at(0xF196);	// @ (0x1E32 * 8 + 6)
#define                                 LC4D3S6_bit         _BIT_ACCESS(CLC4SEL2,6)
// CLC4SEL2<LC4D3S7>
extern volatile __bit                   LC4D3S7             __at(0xF197);	// @ (0x1E32 * 8 + 7)
#define                                 LC4D3S7_bit         _BIT_ACCESS(CLC4SEL2,7)
// CLC4SEL3<LC4D4S0>
extern volatile __bit                   LC4D4S0             __at(0xF198);	// @ (0x1E33 * 8 + 0)
#define                                 LC4D4S0_bit         _BIT_ACCESS(CLC4SEL3,0)
// CLC4SEL3<LC4D4S1>
extern volatile __bit                   LC4D4S1             __at(0xF199);	// @ (0x1E33 * 8 + 1)
#define                                 LC4D4S1_bit         _BIT_ACCESS(CLC4SEL3,1)
// CLC4SEL3<LC4D4S2>
extern volatile __bit                   LC4D4S2             __at(0xF19A);	// @ (0x1E33 * 8 + 2)
#define                                 LC4D4S2_bit         _BIT_ACCESS(CLC4SEL3,2)
// CLC4SEL3<LC4D4S3>
extern volatile __bit                   LC4D4S3             __at(0xF19B);	// @ (0x1E33 * 8 + 3)
#define                                 LC4D4S3_bit         _BIT_ACCESS(CLC4SEL3,3)
// CLC4SEL3<LC4D4S4>
extern volatile __bit                   LC4D4S4             __at(0xF19C);	// @ (0x1E33 * 8 + 4)
#define                                 LC4D4S4_bit         _BIT_ACCESS(CLC4SEL3,4)
// CLC4SEL3<LC4D4S5>
extern volatile __bit                   LC4D4S5             __at(0xF19D);	// @ (0x1E33 * 8 + 5)
#define                                 LC4D4S5_bit         _BIT_ACCESS(CLC4SEL3,5)
// CLC4SEL3<LC4D4S6>
extern volatile __bit                   LC4D4S6             __at(0xF19E);	// @ (0x1E33 * 8 + 6)
#define                                 LC4D4S6_bit         _BIT_ACCESS(CLC4SEL3,6)
// CLC4SEL3<LC4D4S7>
extern volatile __bit                   LC4D4S7             __at(0xF19F);	// @ (0x1E33 * 8 + 7)
#define                                 LC4D4S7_bit         _BIT_ACCESS(CLC4SEL3,7)
// CLC4CON<LC4EN>
extern volatile __bit                   LC4EN               __at(0xF177);	// @ (0x1E2E * 8 + 7)
#define                                 LC4EN_bit           _BIT_ACCESS(CLC4CON,7)
// CLC4GLS0<LC4G1D1N>
extern volatile __bit                   LC4G1D1N            __at(0xF1A0);	// @ (0x1E34 * 8 + 0)
#define                                 LC4G1D1N_bit        _BIT_ACCESS(CLC4GLS0,0)
// CLC4GLS0<LC4G1D1T>
extern volatile __bit                   LC4G1D1T            __at(0xF1A1);	// @ (0x1E34 * 8 + 1)
#define                                 LC4G1D1T_bit        _BIT_ACCESS(CLC4GLS0,1)
// CLC4GLS0<LC4G1D2N>
extern volatile __bit                   LC4G1D2N            __at(0xF1A2);	// @ (0x1E34 * 8 + 2)
#define                                 LC4G1D2N_bit        _BIT_ACCESS(CLC4GLS0,2)
// CLC4GLS0<LC4G1D2T>
extern volatile __bit                   LC4G1D2T            __at(0xF1A3);	// @ (0x1E34 * 8 + 3)
#define                                 LC4G1D2T_bit        _BIT_ACCESS(CLC4GLS0,3)
// CLC4GLS0<LC4G1D3N>
extern volatile __bit                   LC4G1D3N            __at(0xF1A4);	// @ (0x1E34 * 8 + 4)
#define                                 LC4G1D3N_bit        _BIT_ACCESS(CLC4GLS0,4)
// CLC4GLS0<LC4G1D3T>
extern volatile __bit                   LC4G1D3T            __at(0xF1A5);	// @ (0x1E34 * 8 + 5)
#define                                 LC4G1D3T_bit        _BIT_ACCESS(CLC4GLS0,5)
// CLC4GLS0<LC4G1D4N>
extern volatile __bit                   LC4G1D4N            __at(0xF1A6);	// @ (0x1E34 * 8 + 6)
#define                                 LC4G1D4N_bit        _BIT_ACCESS(CLC4GLS0,6)
// CLC4GLS0<LC4G1D4T>
extern volatile __bit                   LC4G1D4T            __at(0xF1A7);	// @ (0x1E34 * 8 + 7)
#define                                 LC4G1D4T_bit        _BIT_ACCESS(CLC4GLS0,7)
// CLC4POL<LC4G1POL>
extern volatile __bit                   LC4G1POL            __at(0xF178);	// @ (0x1E2F * 8 + 0)
#define                                 LC4G1POL_bit        _BIT_ACCESS(CLC4POL,0)
// CLC4GLS1<LC4G2D1N>
extern volatile __bit                   LC4G2D1N            __at(0xF1A8);	// @ (0x1E35 * 8 + 0)
#define                                 LC4G2D1N_bit        _BIT_ACCESS(CLC4GLS1,0)
// CLC4GLS1<LC4G2D1T>
extern volatile __bit                   LC4G2D1T            __at(0xF1A9);	// @ (0x1E35 * 8 + 1)
#define                                 LC4G2D1T_bit        _BIT_ACCESS(CLC4GLS1,1)
// CLC4GLS1<LC4G2D2N>
extern volatile __bit                   LC4G2D2N            __at(0xF1AA);	// @ (0x1E35 * 8 + 2)
#define                                 LC4G2D2N_bit        _BIT_ACCESS(CLC4GLS1,2)
// CLC4GLS1<LC4G2D2T>
extern volatile __bit                   LC4G2D2T            __at(0xF1AB);	// @ (0x1E35 * 8 + 3)
#define                                 LC4G2D2T_bit        _BIT_ACCESS(CLC4GLS1,3)
// CLC4GLS1<LC4G2D3N>
extern volatile __bit                   LC4G2D3N            __at(0xF1AC);	// @ (0x1E35 * 8 + 4)
#define                                 LC4G2D3N_bit        _BIT_ACCESS(CLC4GLS1,4)
// CLC4GLS1<LC4G2D3T>
extern volatile __bit                   LC4G2D3T            __at(0xF1AD);	// @ (0x1E35 * 8 + 5)
#define                                 LC4G2D3T_bit        _BIT_ACCESS(CLC4GLS1,5)
// CLC4GLS1<LC4G2D4N>
extern volatile __bit                   LC4G2D4N            __at(0xF1AE);	// @ (0x1E35 * 8 + 6)
#define                                 LC4G2D4N_bit        _BIT_ACCESS(CLC4GLS1,6)
// CLC4GLS1<LC4G2D4T>
extern volatile __bit                   LC4G2D4T            __at(0xF1AF);	// @ (0x1E35 * 8 + 7)
#define                                 LC4G2D4T_bit        _BIT_ACCESS(CLC4GLS1,7)
// CLC4POL<LC4G2POL>
extern volatile __bit                   LC4G2POL            __at(0xF179);	// @ (0x1E2F * 8 + 1)
#define                                 LC4G2POL_bit        _BIT_ACCESS(CLC4POL,1)
// CLC4GLS2<LC4G3D1N>
extern volatile __bit                   LC4G3D1N            __at(0xF1B0);	// @ (0x1E36 * 8 + 0)
#define                                 LC4G3D1N_bit        _BIT_ACCESS(CLC4GLS2,0)
// CLC4GLS2<LC4G3D1T>
extern volatile __bit                   LC4G3D1T            __at(0xF1B1);	// @ (0x1E36 * 8 + 1)
#define                                 LC4G3D1T_bit        _BIT_ACCESS(CLC4GLS2,1)
// CLC4GLS2<LC4G3D2N>
extern volatile __bit                   LC4G3D2N            __at(0xF1B2);	// @ (0x1E36 * 8 + 2)
#define                                 LC4G3D2N_bit        _BIT_ACCESS(CLC4GLS2,2)
// CLC4GLS2<LC4G3D2T>
extern volatile __bit                   LC4G3D2T            __at(0xF1B3);	// @ (0x1E36 * 8 + 3)
#define                                 LC4G3D2T_bit        _BIT_ACCESS(CLC4GLS2,3)
// CLC4GLS2<LC4G3D3N>
extern volatile __bit                   LC4G3D3N            __at(0xF1B4);	// @ (0x1E36 * 8 + 4)
#define                                 LC4G3D3N_bit        _BIT_ACCESS(CLC4GLS2,4)
// CLC4GLS2<LC4G3D3T>
extern volatile __bit                   LC4G3D3T            __at(0xF1B5);	// @ (0x1E36 * 8 + 5)
#define                                 LC4G3D3T_bit        _BIT_ACCESS(CLC4GLS2,5)
// CLC4GLS2<LC4G3D4N>
extern volatile __bit                   LC4G3D4N            __at(0xF1B6);	// @ (0x1E36 * 8 + 6)
#define                                 LC4G3D4N_bit        _BIT_ACCESS(CLC4GLS2,6)
// CLC4GLS2<LC4G3D4T>
extern volatile __bit                   LC4G3D4T            __at(0xF1B7);	// @ (0x1E36 * 8 + 7)
#define                                 LC4G3D4T_bit        _BIT_ACCESS(CLC4GLS2,7)
// CLC4POL<LC4G3POL>
extern volatile __bit                   LC4G3POL            __at(0xF17A);	// @ (0x1E2F * 8 + 2)
#define                                 LC4G3POL_bit        _BIT_ACCESS(CLC4POL,2)
// CLC4GLS3<LC4G4D1N>
extern volatile __bit                   LC4G4D1N            __at(0xF1B8);	// @ (0x1E37 * 8 + 0)
#define                                 LC4G4D1N_bit        _BIT_ACCESS(CLC4GLS3,0)
// CLC4GLS3<LC4G4D1T>
extern volatile __bit                   LC4G4D1T            __at(0xF1B9);	// @ (0x1E37 * 8 + 1)
#define                                 LC4G4D1T_bit        _BIT_ACCESS(CLC4GLS3,1)
// CLC4GLS3<LC4G4D2N>
extern volatile __bit                   LC4G4D2N            __at(0xF1BA);	// @ (0x1E37 * 8 + 2)
#define                                 LC4G4D2N_bit        _BIT_ACCESS(CLC4GLS3,2)
// CLC4GLS3<LC4G4D2T>
extern volatile __bit                   LC4G4D2T            __at(0xF1BB);	// @ (0x1E37 * 8 + 3)
#define                                 LC4G4D2T_bit        _BIT_ACCESS(CLC4GLS3,3)
// CLC4GLS3<LC4G4D3N>
extern volatile __bit                   LC4G4D3N            __at(0xF1BC);	// @ (0x1E37 * 8 + 4)
#define                                 LC4G4D3N_bit        _BIT_ACCESS(CLC4GLS3,4)
// CLC4GLS3<LC4G4D3T>
extern volatile __bit                   LC4G4D3T            __at(0xF1BD);	// @ (0x1E37 * 8 + 5)
#define                                 LC4G4D3T_bit        _BIT_ACCESS(CLC4GLS3,5)
// CLC4GLS3<LC4G4D4N>
extern volatile __bit                   LC4G4D4N            __at(0xF1BE);	// @ (0x1E37 * 8 + 6)
#define                                 LC4G4D4N_bit        _BIT_ACCESS(CLC4GLS3,6)
// CLC4GLS3<LC4G4D4T>
extern volatile __bit                   LC4G4D4T            __at(0xF1BF);	// @ (0x1E37 * 8 + 7)
#define                                 LC4G4D4T_bit        _BIT_ACCESS(CLC4GLS3,7)
// CLC4POL<LC4G4POL>
extern volatile __bit                   LC4G4POL            __at(0xF17B);	// @ (0x1E2F * 8 + 3)
#define                                 LC4G4POL_bit        _BIT_ACCESS(CLC4POL,3)
// CLC4CON<LC4INTN>
extern volatile __bit                   LC4INTN             __at(0xF173);	// @ (0x1E2E * 8 + 3)
#define                                 LC4INTN_bit         _BIT_ACCESS(CLC4CON,3)
// CLC4CON<LC4INTP>
extern volatile __bit                   LC4INTP             __at(0xF174);	// @ (0x1E2E * 8 + 4)
#define                                 LC4INTP_bit         _BIT_ACCESS(CLC4CON,4)
// CLC4CON<LC4MODE0>
extern volatile __bit                   LC4MODE0            __at(0xF170);	// @ (0x1E2E * 8 + 0)
#define                                 LC4MODE0_bit        _BIT_ACCESS(CLC4CON,0)
// CLC4CON<LC4MODE1>
extern volatile __bit                   LC4MODE1            __at(0xF171);	// @ (0x1E2E * 8 + 1)
#define                                 LC4MODE1_bit        _BIT_ACCESS(CLC4CON,1)
// CLC4CON<LC4MODE2>
extern volatile __bit                   LC4MODE2            __at(0xF172);	// @ (0x1E2E * 8 + 2)
#define                                 LC4MODE2_bit        _BIT_ACCESS(CLC4CON,2)
// CLC4CON<LC4OUT>
extern volatile __bit                   LC4OUT              __at(0xF175);	// @ (0x1E2E * 8 + 5)
#define                                 LC4OUT_bit          _BIT_ACCESS(CLC4CON,5)
// CLC4POL<LC4POL>
extern volatile __bit                   LC4POL              __at(0xF17F);	// @ (0x1E2F * 8 + 7)
#define                                 LC4POL_bit          _BIT_ACCESS(CLC4POL,7)
// OSCEN<LFOEN>
extern volatile __bit                   LFOEN               __at(0x448C);	// @ (0x891 * 8 + 4)
#define                                 LFOEN_bit           _BIT_ACCESS(OSCEN,4)
// OSCSTAT<LFOR>
extern volatile __bit                   LFOR                __at(0x4484);	// @ (0x890 * 8 + 4)
#define                                 LFOR_bit            _BIT_ACCESS(OSCSTAT,4)
// NVMCON1<LWLO>
extern volatile __bit                   LWLO                __at(0x40F5);	// @ (0x81E * 8 + 5)
#define                                 LWLO_bit            _BIT_ACCESS(NVMCON1,5)
// CMOUT<MC1OUT>
extern volatile __bit                   MC1OUT              __at(0x4C78);	// @ (0x98F * 8 + 0)
#define                                 MC1OUT_bit          _BIT_ACCESS(CMOUT,0)
// CMOUT<MC2OUT>
extern volatile __bit                   MC2OUT              __at(0x4C79);	// @ (0x98F * 8 + 1)
#define                                 MC2OUT_bit          _BIT_ACCESS(CMOUT,1)
// MDCON0<MDBIT>
extern volatile __bit                   MDBIT               __at(0x44B8);	// @ (0x897 * 8 + 0)
#define                                 MDBIT_bit           _BIT_ACCESS(MDCON0,0)
// MDCARHPPS<MDCARHPPS0>
extern volatile __bit                   MDCARHPPS0          __at(0xF5C8);	// @ (0x1EB9 * 8 + 0)
#define                                 MDCARHPPS0_bit      _BIT_ACCESS(MDCARHPPS,0)
// MDCARHPPS<MDCARHPPS1>
extern volatile __bit                   MDCARHPPS1          __at(0xF5C9);	// @ (0x1EB9 * 8 + 1)
#define                                 MDCARHPPS1_bit      _BIT_ACCESS(MDCARHPPS,1)
// MDCARHPPS<MDCARHPPS2>
extern volatile __bit                   MDCARHPPS2          __at(0xF5CA);	// @ (0x1EB9 * 8 + 2)
#define                                 MDCARHPPS2_bit      _BIT_ACCESS(MDCARHPPS,2)
// MDCARHPPS<MDCARHPPS3>
extern volatile __bit                   MDCARHPPS3          __at(0xF5CB);	// @ (0x1EB9 * 8 + 3)
#define                                 MDCARHPPS3_bit      _BIT_ACCESS(MDCARHPPS,3)
// MDCARHPPS<MDCARHPPS4>
extern volatile __bit                   MDCARHPPS4          __at(0xF5CC);	// @ (0x1EB9 * 8 + 4)
#define                                 MDCARHPPS4_bit      _BIT_ACCESS(MDCARHPPS,4)
// MDCARLPPS<MDCARLPPS0>
extern volatile __bit                   MDCARLPPS0          __at(0xF5C0);	// @ (0x1EB8 * 8 + 0)
#define                                 MDCARLPPS0_bit      _BIT_ACCESS(MDCARLPPS,0)
// MDCARLPPS<MDCARLPPS1>
extern volatile __bit                   MDCARLPPS1          __at(0xF5C1);	// @ (0x1EB8 * 8 + 1)
#define                                 MDCARLPPS1_bit      _BIT_ACCESS(MDCARLPPS,1)
// MDCARLPPS<MDCARLPPS2>
extern volatile __bit                   MDCARLPPS2          __at(0xF5C2);	// @ (0x1EB8 * 8 + 2)
#define                                 MDCARLPPS2_bit      _BIT_ACCESS(MDCARLPPS,2)
// MDCARLPPS<MDCARLPPS3>
extern volatile __bit                   MDCARLPPS3          __at(0xF5C3);	// @ (0x1EB8 * 8 + 3)
#define                                 MDCARLPPS3_bit      _BIT_ACCESS(MDCARLPPS,3)
// MDCARLPPS<MDCARLPPS4>
extern volatile __bit                   MDCARLPPS4          __at(0xF5C4);	// @ (0x1EB8 * 8 + 4)
#define                                 MDCARLPPS4_bit      _BIT_ACCESS(MDCARLPPS,4)
// MDCARH<MDCH0>
extern volatile __bit                   MDCH0               __at(0x44D8);	// @ (0x89B * 8 + 0)
#define                                 MDCH0_bit           _BIT_ACCESS(MDCARH,0)
// MDCARH<MDCH1>
extern volatile __bit                   MDCH1               __at(0x44D9);	// @ (0x89B * 8 + 1)
#define                                 MDCH1_bit           _BIT_ACCESS(MDCARH,1)
// MDCARH<MDCH2>
extern volatile __bit                   MDCH2               __at(0x44DA);	// @ (0x89B * 8 + 2)
#define                                 MDCH2_bit           _BIT_ACCESS(MDCARH,2)
// MDCARH<MDCH3>
extern volatile __bit                   MDCH3               __at(0x44DB);	// @ (0x89B * 8 + 3)
#define                                 MDCH3_bit           _BIT_ACCESS(MDCARH,3)
// MDCON1<MDCHPOL>
extern volatile __bit                   MDCHPOL             __at(0x44C5);	// @ (0x898 * 8 + 5)
#define                                 MDCHPOL_bit         _BIT_ACCESS(MDCON1,5)
// MDCON1<MDCHSYNC>
extern volatile __bit                   MDCHSYNC            __at(0x44C4);	// @ (0x898 * 8 + 4)
#define                                 MDCHSYNC_bit        _BIT_ACCESS(MDCON1,4)
// MDCARL<MDCL0>
extern volatile __bit                   MDCL0               __at(0x44D0);	// @ (0x89A * 8 + 0)
#define                                 MDCL0_bit           _BIT_ACCESS(MDCARL,0)
// MDCARL<MDCL1>
extern volatile __bit                   MDCL1               __at(0x44D1);	// @ (0x89A * 8 + 1)
#define                                 MDCL1_bit           _BIT_ACCESS(MDCARL,1)
// MDCARL<MDCL2>
extern volatile __bit                   MDCL2               __at(0x44D2);	// @ (0x89A * 8 + 2)
#define                                 MDCL2_bit           _BIT_ACCESS(MDCARL,2)
// MDCARL<MDCL3>
extern volatile __bit                   MDCL3               __at(0x44D3);	// @ (0x89A * 8 + 3)
#define                                 MDCL3_bit           _BIT_ACCESS(MDCARL,3)
// MDCON1<MDCLPOL>
extern volatile __bit                   MDCLPOL             __at(0x44C1);	// @ (0x898 * 8 + 1)
#define                                 MDCLPOL_bit         _BIT_ACCESS(MDCON1,1)
// MDCON1<MDCLSYNC>
extern volatile __bit                   MDCLSYNC            __at(0x44C0);	// @ (0x898 * 8 + 0)
#define                                 MDCLSYNC_bit        _BIT_ACCESS(MDCON1,0)
// MDCON0<MDEN>
extern volatile __bit                   MDEN                __at(0x44BF);	// @ (0x897 * 8 + 7)
#define                                 MDEN_bit            _BIT_ACCESS(MDCON0,7)
// MDSRC<MDMS0>
extern volatile __bit                   MDMS0               __at(0x44C8);	// @ (0x899 * 8 + 0)
#define                                 MDMS0_bit           _BIT_ACCESS(MDSRC,0)
// MDSRC<MDMS1>
extern volatile __bit                   MDMS1               __at(0x44C9);	// @ (0x899 * 8 + 1)
#define                                 MDMS1_bit           _BIT_ACCESS(MDSRC,1)
// MDSRC<MDMS2>
extern volatile __bit                   MDMS2               __at(0x44CA);	// @ (0x899 * 8 + 2)
#define                                 MDMS2_bit           _BIT_ACCESS(MDSRC,2)
// MDSRC<MDMS3>
extern volatile __bit                   MDMS3               __at(0x44CB);	// @ (0x899 * 8 + 3)
#define                                 MDMS3_bit           _BIT_ACCESS(MDSRC,3)
// MDSRC<MDMS4>
extern volatile __bit                   MDMS4               __at(0x44CC);	// @ (0x899 * 8 + 4)
#define                                 MDMS4_bit           _BIT_ACCESS(MDSRC,4)
// MDCON0<MDOPOL>
extern volatile __bit                   MDOPOL              __at(0x44BC);	// @ (0x897 * 8 + 4)
#define                                 MDOPOL_bit          _BIT_ACCESS(MDCON0,4)
// MDCON0<MDOUT>
extern volatile __bit                   MDOUT               __at(0x44BD);	// @ (0x897 * 8 + 5)
#define                                 MDOUT_bit           _BIT_ACCESS(MDCON0,5)
// MDSRCPPS<MDSRCPPS0>
extern volatile __bit                   MDSRCPPS0           __at(0xF5D0);	// @ (0x1EBA * 8 + 0)
#define                                 MDSRCPPS0_bit       _BIT_ACCESS(MDSRCPPS,0)
// MDSRCPPS<MDSRCPPS1>
extern volatile __bit                   MDSRCPPS1           __at(0xF5D1);	// @ (0x1EBA * 8 + 1)
#define                                 MDSRCPPS1_bit       _BIT_ACCESS(MDSRCPPS,1)
// MDSRCPPS<MDSRCPPS2>
extern volatile __bit                   MDSRCPPS2           __at(0xF5D2);	// @ (0x1EBA * 8 + 2)
